<a href="https://colab.research.google.com/github/Sinchiguano/chicagoUniversity/blob/main/nonLinearDataSet.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [43]:
from sklearn.linear_model import LinearRegression
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

In [44]:

# ctrl + / in order to comment
import pandas as pd
from google.colab import files
url = 'https://raw.githubusercontent.com/Sinchiguano/chicagoUniversity/main/salary_2015.csv'
df = pd.read_csv(url)
print(df.head(5))
print(df.dtypes)

   year  location       first        last                  title    gross  \
0  2015  Berkeley        ANNE       AABOE          BUS SYS ANL 4  124,454
1  2015  Berkeley       DAVID       AAKER         RECALL FACULTY    2,500
2  2015  Berkeley   ELIZABETH        ABEL                PROF-AY  138,775
3  2015  Berkeley      NORMAN  ABRAHAMSON  ADJ PROF-AY-1/9-B/E/E   19,668
4  2015  Berkeley     BARBARA      ABRAMS                PROF-AY  191,162

   regular overtime   other
0  124,454        0       0
1        0        0   2,500
2  138,775        0       0
3   19,668        0       0
4  169,862        0  21,300
year         int64
location    object
first       object
last        object
title       object
gross       object
regular     object
overtime    object
other       object
dtype: object

In [45]:
df['gross'] = df['gross'].str.replace(',', '')
df['gross'] = df['gross'].astype(int)
df.head(5)
df.dtypes

year         int64
location    object
first       object
last        object
title       object
gross        int64
regular     object
overtime    object
other       object
dtype: object

In [46]:
print(df.head(23))

    year  location       first        last                  title   gross  \
0   2015  Berkeley        ANNE       AABOE          BUS SYS ANL 4  124454
1   2015  Berkeley       DAVID       AAKER         RECALL FACULTY    2500
2   2015  Berkeley   ELIZABETH        ABEL                PROF-AY  138775
3   2015  Berkeley      NORMAN  ABRAHAMSON  ADJ PROF-AY-1/9-B/E/E   19668
4   2015  Berkeley     BARBARA      ABRAMS                PROF-AY  191162
5   2015  Berkeley        JOHN       ACZON    FINANCIAL SVC ANL 3   83510
6   2015  Berkeley     ANTHONY       ADAMS                 RES-FY    9587
7   2015  Berkeley       PENNY       HINES          ACAD HR ANL 5  126707
8   2015  Berkeley    ANINDITA    ADHIKARI         SR LECT SOE-AY  107345
9   2015  Berkeley        ILAN       ADLER          PROF-AY-B/E/E  166617
10  2015  Berkeley       VINOD    AGGARWAL                PROF-AY  167525
11  2015  Berkeley       ALICE     AGOGINO          PROF-AY-B/E/E  243259
12  2015  Berkeley        JOHN       AGRAZ             DEV TCHN 3     363
13  2015  Berkeley         ADA     AGUILAR   PROJECT POLICY ANL 2   59072
14  2015  Berkeley        AMOR       AGUON     COMPENSATION ANL 4  101639
15  2015  Berkeley      GEORGE     AKERLOF         RECALL FACULTY   47990
16  2015  Berkeley       MITRA     AKHTARI              SRA 2 NEX   43832
17  2015  Berkeley       DIANE      MILANO          EVENTS SPEC 3   49381
18  2015  Berkeley       CRAIG    ALDERSON          LIBRARY AST 4   27605
19  2015  Berkeley       DAVID      ALDOUS                PROF-AY  218666
20  2015  Berkeley     RONELLE   ALEXANDER                PROF-AY  167642
21  2015  Berkeley       ROSIA   ALEXANDER              SYS ADM 3   80964
22  2015  Berkeley     SAUNDRA   ALEXANDER    FINANCIAL SVC ANL 3   69274

    regular overtime   other
0   124,454        0       0
1         0        0   2,500
2   138,775        0       0
3    19,668        0       0
4   169,862        0  21,300
5    78,510        0   5,000
6     9,587        0       0
7   126,707        0       0
8   107,345        0       0
9   151,617        0  15,000
10  167,525        0       0
11  203,150        0  40,109
12      363        0       0
13   59,072        0       0
14  101,139        0     500
15        0        0  47,990
16   43,832        0       0
17   49,381        0       0
18   27,605        0       0
19  183,225        0  35,441
20  167,642        0       0
21   80,964        0       0
22   67,274        0   2,000

In [70]:
# print(df.tail(20))
print('********************')
mean_salaries=pd.DataFrame(df.groupby('title')['gross'].count())
print(mean_salaries.head(5))

mean_salaries=pd.DataFrame(df.groupby('title')['gross'].mean())
print(mean_salaries.head(5))

mean_salaries=pd.DataFrame(df.groupby('title')['gross'].mean().reset_index())
print(mean_salaries.head(5))

mean_salaries=pd.DataFrame(df.groupby('title')['gross'].mean().reset_index(name='meanValue'))
print(mean_salaries.head(5))

********************
                            gross
title
ABLE SEAMAN                    16
ABSOLUTE RETURNS INV MGR 3      2
ABSOLUTE RETURNS INV OFCR       1
ACAD ACHIEVEMENT CNSLR 2       21
ACAD ACHIEVEMENT CNSLR 3       11
                                    gross
title
ABLE SEAMAN                  30707.125000
ABSOLUTE RETURNS INV MGR 3  472294.000000
ABSOLUTE RETURNS INV OFCR   253152.000000
ACAD ACHIEVEMENT CNSLR 2     30020.666667
ACAD ACHIEVEMENT CNSLR 3     55218.000000
                        title          gross
0                 ABLE SEAMAN   30707.125000
1  ABSOLUTE RETURNS INV MGR 3  472294.000000
2   ABSOLUTE RETURNS INV OFCR  253152.000000
3    ACAD ACHIEVEMENT CNSLR 2   30020.666667
4    ACAD ACHIEVEMENT CNSLR 3   55218.000000
                        title           mean
0                 ABLE SEAMAN   30707.125000
1  ABSOLUTE RETURNS INV MGR 3  472294.000000
2   ABSOLUTE RETURNS INV OFCR  253152.000000
3    ACAD ACHIEVEMENT CNSLR 2   30020.666667
4    ACAD ACHIEVEMENT CNSLR 3   55218.000000